Revit 2026 API

# ParameterUtilsIsBuiltInGroup Method

---

Checks whether a ForgeTypeId identifies a built-in parameter group.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsBuiltInGroup(
	ForgeTypeId groupTypeId
)
```
```vb
Public Shared Function IsBuiltInGroup (
	groupTypeId As ForgeTypeId
) As Boolean
```
```cpp
public:
static bool IsBuiltInGroup(
	ForgeTypeId^ groupTypeId
)
```
```fsharp
static member IsBuiltInGroup :
        groupTypeId : ForgeTypeId -> bool
```

#### Parameters

groupTypeId ForgeTypeId
     The identifier to check.

#### Return Value

Boolean True if the ForgeTypeId identifies a built-in parameter group, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A ForgeTypeId identifies a built-in parameter group if it corresponds to a valid BuiltInParameterGroup value.

#### Reference

ParameterUtils Class

Autodesk.Revit.DB Namespace